package com.topic.passPmpPdf;

import com.base.BaseTest;

/**
 * 成功通过PMP-PDF（P473~484）
 * 
 * @author JianDe
 */
public class PassPmpPdf15_1 extends BaseTest {
    public PassPmpPdf15_1() {
        super("BACDCDADADABDAADADCC");
    }

    public static void main(String[] args) {
        BaseTest pm1 = new PassPmpPdf15_1();
        pm1.test("BAABC BDBDA ABDAA CABCA"); // 2018-02-26
    }

}
/*
 * 3．答案：C。有些人认为这个问题的正确答案不止一个。然而并非如此。有许多事情项目经理可以做，但应该做些什么？
 * 公司政策由项目管理办公室管理，并且项目经理应该直接发给干系人有关项目管理的公司权威政策，并确保其获得准确信息。
 * 
 * 4．答案：D。最好的答案是干系人，因为他们的输入对于收集每个项目的经验教训是至关重要的。术语“干系人”包括所有其他团体。
 * 
 * 6．答案：D。这是另一个不止有一个正确答案的问题。要求一些书面的东西是否是最佳的沟通方式呢？
 * 在这个特定的情况下，强制要求书面表达有可能会得罪干系人。问题日志是问题应该被罗列的地方，但是情况并不表明项目经理是否知道干系人的担忧。
 * 因此，使用问题日志并不是最佳选项。为什么不向所有的干系人做一个关于项目状态的展示？项目经理已经知道干系人A和B有担忧，并不是所有的干系人。
 * 问题有可能需要非正式口头沟通来发现真正的问题。因此为担忧的干系人安排一个会议是最佳选项。
 * 
 * 7．答案：A。看上去这些都是好主意，但是让干系人回顾项目要求可以帮助发现错误和变更，因此可以被当作是最佳选项。
 * 
 * 8．答案：D。这个问题应该完结了，但是既然有很多关于被移除的要求的会议和争论，问题不大可能会被干系人所丢弃。
 * 但是既然它没有再次出现，且项目六个月之前开始，在会议上花时间就有点过了。其他的选择要简单些，对项目的影响小一些，因此事情也可以完成了。
 * 
 * 9．答案：A。干系人在整个项目中都有影响，但是他们必须被识别出来，并且在这个项目中涉及，以此来判断他们的需求满意度。
 * 如果不尽早努力，结果可能是昂贵的变更和或是对今后项目中的不满意情绪。
 * 
 * 10．答案：D。寻找可以解决实际问题的选项十分重要。管理培训、远见、需要更多流程都是原因之一，但是根本原因是干系人没有识别，没有需求了。
 * 那些干系人现在正要求一些变更来满足他们的需要。
 * 
 * 16．答案：D。A、B和C是具体的沟通方法了。题目没有提及该项目的沟通管理计划是怎样的，这些做法是不是满足干系人的信息需求和信息发布方式，
 * 我们无法判断，不能选择。答案D符合项目沟通管理的要求。
 * 
 * 18．答案：D。项目外部干系人通常是指对项目和项目结果有影响的个人或团体，因此需要用公共关系的技能来处理与其的关系。
 * 
 * 20．答案：C。当确定信息接收的对象后，需要进一步说明对要发布信息的描述，包括格式、内容及详细程度。
 * 
 */
