package com.topic.passPmpPdf;

import com.base.BaseTest;

/**
 * 成功通过PMP-PDF（P446~455）TODO
 * 
 * @author JianDe
 */
public class PassPmpPdf14_1 extends BaseTest {
    public PassPmpPdf14_1(String result) {
        super("CDCCDACDBCACCCCCCBAC");
    }

    public static void main(String[] args) {
        BaseTest pm1 = new PassPmpPdf14_1(null);
        pm1.test("DACAD ADDDB CBCAC DAAAC"); // 2018-02-26
    }

}
/*
 * 1．答案：C。采购审计是在结束采购时所做的从规划采购到控制采购的整个采购进程进行系统的结构性复查。目的在于找到供其他项目借鉴的经验教训，
 * 其结果归入历史数据库（见《PMBOKⓇ指南》第五版12.4.2.1）。选项A、B、D是结束采购都要涉及的工作。
 * 合同收尾是一个一次性的工作；而行政收尾有可能会做多次，即所谓的阶段性管理收尾。
 * 
 * 2．答案：D。对于范围不能确定的外包，选择总价合同将可能导致所购非所需，从而引发成本风险。而时间＋材料合同对范围可以渐进明细，
 * 并最终获得需要的产品和服务（见《PMBOKⓇ指南》第五版12.1.1.9）。选项A适用于范围定义明确的项目；
 * 选项B是选项A的一种变形，目的在于鼓励节约；选项C是费用补偿合同的一种，在美国政府采购项目中禁止使用。
 * 
 * 4．答案：C。在结束采购时，负责合同管理的人员或组织应该向卖方出具正式的书面文件，确认合同已结束（见《PMBOKⓇ指南》第五版12.4.3.1）。
 * 
 * 7．答案：C。开发采购文件是规划采购阶段的成果之一，选项A开发详细的规格与设计是为完成规划采购阶段的主要成果——采购工作说明书所做的工作
 * （见《PMBOKⓇ指南》第五版12.1.3.2），选项B自制或购买分析是规划采购阶段的技术，选项D准备合格供应商清单是实施采购阶段的工作。
 * 
 * 9．答案：B。作为一名项目经理，你想在谈判期间发展一段良好的关系，可以在整个项目中都持续下去。
 * 
 * 10．答案：C。虽然详细的规定可能会减少变更的需要，但它们并不会消除变更条款。合同应该包括适应变更的程序。
 * 
 * 11．答案：A。合同收尾与行政收尾都需要确认核实工作已按要求完成（见《PMBOKⓇ指南》第五版12.4）。
 * 
 * 12．答案：C。这是一道典型的过程题，它问的是哪项不是规划采购工具和技术。该阶段是在项目规划采购刚刚开始的时候。
 * 在这个阶段你要决定是自制还是购买。它还包括确定购买什么，如何去购买和购买数量与时间。因此，一旦你决定到公司外购买，你要选择使用什么类型的合同。
 * SOW（工作说明）是规划采购过程的一项成果，而不是规划采购中的一个工具或一项技术（见《PMBOKⓇ指南》第五版12.1）。
 * 
 * 14．答案：C。请注意，PMI对审计有不同的定义。根据PMI，审计用于对过程进行改进。
 * 
 * 16．答案：C。总价合同是固定价格合同的另一个名称。在固定价格合同中，卖方承担最高的风险。最高的风险也意味着获得利润的最大机会。
 * 卖方对成本控制有较大的主动权范围更加固定并且不会有很多变更。可利用排除法解答本题：选项A固定价格合同对买方风险最小。
 * 选项B成本补偿合同（加固定费）通常给卖方提供的利润（和风险）最低。选项D单价合同在大多数地方可定为合法的，
 * 否则你就不能在一家商店买一个苹果。成本补偿加成本百分比类型在美国的政府合同中是非法的。
 * 
 * 17．答案：C。要求你知道在采购过程中每一个采购过程包含哪些活动。
 * 
 * 18．答案：B。改变固定费合同的唯一方法是商谈合同变更，通常以变更令的形式出现。
 * 
 */
