package com.topic.passPmpPdf;

import com.base.BaseTest;

/**
 * 成功通过PMP-PDF（P349~358）
 * 
 * @author JianDe
 */
public class PassPmpPdf11_1 extends BaseTest {
    public PassPmpPdf11_1() {
        super("DDABACACADCBBDAACCCC");
    }

    public static void main(String[] args) {
        BaseTest pm1 = new PassPmpPdf11_1();
        pm1.test("DBCBA CBCAD CBDDB DCCBC"); // 2018-02-23
    }

}
/*
 * 2．答案：D。事实上，纯项目型组织结构的特征不仅包括A、B、C。还有一个就是对范围的完全控制。
 * 
 * 3．答案：A。参见《PMBOKⓇ指南》第五版2.1.3，矩阵型组织的重要属性是，可以实现对资源的共享，当组织没有足够的资源分别分配给每一个项目时，这种组织结构特别有效。B的情形适合于项目型组织结构。C是没有什么根据的。
 * D恰恰与项目型组织的惯例是矛盾的，项目完成后，团队成员一般都需要回到“家”——职能部门。
 * 
 * 7．答案：A。资源直方图显示了在每个时间段使用的资源数量。在它的纯表格中，横道图只显示了活动和日历日期。组织（结构）图显示了谁向谁报告。责任分配矩阵显示了谁要做什么工作。TODO
 * 
 * 13．答案：B。团结人员是作为领导者角色的一个重要工作，体现了项目经理的领导能力，注意管理能力与领导能力的区别。
 * 
 * 15．答案：A。旷工、项目人员流动和团队冲突都是团队动机降低的迹象。一个项目经理必须及时采取措施。注意，不停的范围变更也可以起到涣散团队的催化剂作用。
 * 
 * 16．答案：A。参见本章解决冲突的五种方法之一妥协，它是一种双输的解决问题方式，双方均让步，哪一方都不会赢。这可能是（也可能不是）问题的最佳解决方案。在例子中，每个工程师都可能有可行的技术解决方案，
 * 而折中的方案实际上可能比他们任何一个人的方案都差。
 * 
 * 19．答案：C。参见《PMBOKⓇ指南》第五版图9-6资源直方图是考虑了时间因素的资源利用图。
 * 
 */
