package com.topic.passPmpPdf;

import com.base.BaseTest;

/**
 * 成功通过PMP-PDF（P378~386）
 * 
 * @author JianDe
 */
public class PassPmpPdf12_1 extends BaseTest {
    public PassPmpPdf12_1() {
        super("DDBBDDACDADDCDADBACB");
    }

    public static void main(String[] args) {
        BaseTest pm1 = new PassPmpPdf12_1();
        pm1.test("DDBBA AACDA CADDB ABBCB"); // 2018-02-24
    }

}
/*
 * 5．答案：D。工作分解结构可以在组织内用作水平和垂直的沟通，也可以用于项目的外部。
 * 
 * 6．答案：D。见《PMBOKⓇ指南》第五版10.1.2.3。
 * 
 * 11．答案：D。这种情况描述了“比较”的需要。一份趋势报告显示了随着时间的表现，一份预测报告仅仅看到了未来。
 * 一份状态报告大致是静态的（描述了某一个时刻）。比较项目结果的唯一选择就是差异分析。
 * 
 * 12．答案：D。和来自不同文化，有着不同文化价值观和信仰的人共同工作迫使对基本定义和文化影响区域有了解。
 * 作为一名项目经理，我们需要有好的沟通技巧，并且愿意适应其他的文化。
 * 
 * 13．答案：C。选项A中沟通的内容不会局限于产品、进度、质量和费用，有时候还包括风险和采购方面的信息。
 * 选项D项目中的信息不是对所有项目干系人都一致的，必须对信息和项目干系人的信息需求进行分类，因而也不是所有信息对所有人都是共享的。
 * 
 * 15．答案：A。
 * 
 * 16．答案：D。在矩阵型组织中，由于存在双重报告关系，项目团队成员既要向项目经理报告，又要向职能经理报告，所以信息沟通的有效性显得尤其重要。
 * 
 * 18．答案：A。项目的目标如果与职能部门的目标发生冲突，将是最难处理和解决的，也是可能产生最严重后果的冲突，
 * 选项B、C和D所阐述的都是在项目过程中可能发生冲突的原因，都可以在项目内部加以解决。
 * 
 */
