package com.topic.passPmpPdf;

import com.base.BaseTest;

/**
 * 成功通过PMP-PDF（P386~396）
 * 
 * @author JianDe
 */
public class PassPmpPdf12_2 extends BaseTest {
    public PassPmpPdf12_2() {
        super("DACCABBABBDBDBBDDACA");
    }

    public static void main(String[] args) {
        BaseTest pm1 = new PassPmpPdf12_2();
        pm1.test("DACCA CAAAB DBBAA CDACA"); // 2018-02-24
    }

}
/*
 * 6．答案：B。在沟通计划、需求收集、风险管理和项目管理的其他方面加入职能经理将会对项目有更好的帮助。
 * 除此之外，它帮助了职能经理有效地管理他们的资源。如果被分派到前期活动的团队成员的职能经理被包括在项目计划的过程中就参与了该项目，
 * 他会知道该成员什么时候需要为项目进行工作和影响该项目，或者延迟。沟通管理计划同时也应该包含一种沟通潜在延迟的方法。
 * 
 * 7．答案：B。将项目计划进行文档化，就是为了方便沟通，而信息的分发本身就是沟通内容的一部分。
 * 
 * 9．答案：B。这是一个沟通方法的题目。本题通用排除法，邮件人有反馈回路多且不及时的弱点，选项C频繁的电话会议不现实（时区不同），
 * 选项D面对面的会议也不具有可行性（团队成员分布在不同的国家和地区）。
 * 
 * 13．答案：D。参见本章项目团队成员之间的沟通原则，其中面对面的沟通较有利，而且能帮助快速建立工作关系。
 * 选项A在重要的工作移交中，缺乏面对面的沟通，而且可能不能满足Carol对沟通目标的期望。选项B太正式了。
 * 选项C使Carol处于尴尬境况，另外多人跟他谈，内容可能太多，效果也可能不好。
 * 
 * 14．答案：B。参见《PMBOKⓇ指南》第五版10.3.3.1。
 * 
 * 15．答案：B。有效的会议，“作战室”和紧密型矩阵可以促进有效的沟通。选项A、C、D明显是不对的。事实上，保证团队有效沟通的措施通常有：
 * ■ 项目经理必须成为有效的沟通者，项目经理必须鼓励反馈和达成一致；
 * ■ 项目经理必须将人们集合起来，建立关系，建立正式和非正式的沟通渠道；
 * ■ 避免沟通阻断器，例如，“这样没有用”，“让我们现实一点”等都会打击沟通积极性，阻断沟通；
 * ■ 紧密型矩阵，各职能部门的团队成员分配一个单独的办公空间；
 * ■ 作战室，项目团队集合在一个单独的地方有利于提高沟通水平；
 * ■ 有效的会议，会议必须进行计划、准备和实施，会议的目的一定要清楚，议程必须事先准备好，会议记录分发给大家。
 * 
 * 16．答案：D。该题目描述的是“对比”的需要，拿实际结果和计划之间进行对比。而趋势报告显示的是一定时间段的绩效。
 * 状态报告一般是静态的（与一定的时间点有关）。预测报告只是关注未来。
 * 
 */
